modm-ext/archive-stmicro-svd/header_stm32h750ibk6.svd
      <register>
        <name>CR6</name>
        <addressOffset>0xa0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>M0AR5</name>
        <addressOffset>0xa0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR6</name>
        <addressOffset>0xa0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>NDTR6</name>
        <addressOffset>0xa4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>NDTR6</name>
        <addressOffset>0xa4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FCR4</name>
        <addressOffset>0xac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>PAR6</name>
        <addressOffset>0xac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FCR4</name>
        <addressOffset>0xac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>PAR6</name>
        <addressOffset>0xac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>M1AR5</name>
        <addressOffset>0xb0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>M1AR5</name>
        <addressOffset>0xb0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>M0AR6</name>
        <addressOffset>0xb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR7</name>
        <addressOffset>0xb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>M0AR6</name>
        <addressOffset>0xb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR7</name>
        <addressOffset>0xb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>NDTR7</name>
        <addressOffset>0xbc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>NDTR7</name>
        <addressOffset>0xbc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FCR5</name>
        <addressOffset>0xc4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>PAR7</name>
        <addressOffset>0xc4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FCR5</name>
        <addressOffset>0xc4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>PAR7</name>
        <addressOffset>0xc4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>M1AR6</name>
        <addressOffset>0xc8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>M1AR6</name>
        <addressOffset>0xc8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>M0AR7</name>
        <addressOffset>0xd0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>M0AR7</name>
        <addressOffset>0xd0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FCR6</name>
        <addressOffset>0xdc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FCR6</name>
        <addressOffset>0xdc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>M1AR7</name>
        <addressOffset>0xe0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>M1AR7</name>
        <addressOffset>0xe0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FCR7</name>
        <addressOffset>0xf4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FCR7</name>
        <addressOffset>0xf4</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>DMAMUX1</name>
      <baseAddress>0x40020800</baseAddress>
      <register>
        <name>CCR0</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR0</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR1</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR1</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR2</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR2</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR3</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR3</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR4</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR4</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR5</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR5</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR6</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR6</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR7</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR7</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR8</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR9</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR0</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR1</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR2</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR3</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR4</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR5</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCRs</name>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCRs</name>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR0</name>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR0</name>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR1</name>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR1</name>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR2</name>
        <addressOffset>0x108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR2</name>
        <addressOffset>0x108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR3</name>
        <addressOffset>0x10c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR3</name>
        <addressOffset>0x10c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR4</name>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR4</name>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR5</name>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR5</name>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR6</name>
        <addressOffset>0x118</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR6</name>
        <addressOffset>0x118</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR7</name>
        <addressOffset>0x11c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR7</name>
        <addressOffset>0x11c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCRs</name>
        <addressOffset>0x140</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCRs</name>
        <addressOffset>0x140</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>ADC1</name>
      <baseAddress>0x40022000</baseAddress>
      <register>
        <name>ISR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ADRDY</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOSMP</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOC</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOS</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OVR</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JEOC</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JEOS</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD1</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD2</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD3</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JQOVF</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LDORDY</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IER</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ADRDYIE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOSMPIE</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOCIE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOSIE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OVRIE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JEOCIE</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JEOSIE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD1IE</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD2IE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD3IE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JQOVFIE</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ADEN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADDIS</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADSTART</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JADSTART</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADSTP</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JADSTP</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOOST</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>ADCALLIN</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LINCALRDYW1</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LINCALRDYW2</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LINCALRDYW3</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LINCALRDYW4</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LINCALRDYW5</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LINCALRDYW6</name>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADVREGEN</name>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DEEPPWD</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADCALDIF</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADCAL</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CFGR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMNGT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>RES</name>
            <bitOffset>2</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>EXTSEL</name>
            <bitOffset>5</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>EXTEN</name>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OVRMOD</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CONT</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AUTDLY</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DISCEN</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DISCNUM</name>
            <bitOffset>17</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>JDISCEN</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JQM</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD1SGL</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD1EN</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JAWD1EN</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JAUTO</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD1CH</name>
            <bitOffset>26</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>JQDIS</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CFGR2</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ROVSE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JOVSE</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OVSS</name>
            <bitOffset>5</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>TROVS</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ROVSM</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RSHIFT1</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RSHIFT2</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RSHIFT3</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RSHIFT4</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OVSR</name>
            <bitOffset>16</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          <field>
            <name>LSHIFT</name>
            <bitOffset>28</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SMPR1</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SMP0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP1</name>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP2</name>
            <bitOffset>6</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP3</name>
            <bitOffset>9</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP4</name>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP5</name>
            <bitOffset>15</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP6</name>
            <bitOffset>18</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP7</name>
            <bitOffset>21</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP8</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP9</name>
            <bitOffset>27</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SMPR2</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SMP10</name>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP11</name>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP12</name>
            <bitOffset>6</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP13</name>
            <bitOffset>9</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP14</name>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP16</name>
            <bitOffset>18</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP17</name>
            <bitOffset>21</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP18</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP19</name>
            <bitOffset>27</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
